@00000000
1f 40 02 93 // addi x5,x0,500
00 44 04 13 // addi x8,x8,4
00 b2 86 b3 // add x13,x5,x11
00 44 00 b3 //add x1,x8,x4
00 40 07 93 //addi x15, x0, 4
00 80 07 93 //addi x15, x0, 8
01 00 07 93 // addi x15, x0, 16
40 42 87 33 // sub x14, x5, x4
00 45 c5 b3 // xor x11,x11,x4
00 44 06 33 // add x12,x8,x4
00 d4 20 a3 // sw x13, 1(x8)
00 14 21 03 // lw x2, 1(x8)
00 41 01 b3 // add x3,x2,x4
ff f2 82 93 // addi x5,x5,-1
fc 02 94 e3 // bne x5,x0,-56
00 a3 82 33 // add x4,x7,x10
00 10 00 93 // addi x1,x0,1

@0000004C
fe 00 0e e3  // BEQ x0, x0, -4

@000002BC
00 20 1f 73  // 메모리[700] 명령어
00 10 1e f3  // 메모리[704] 명령어
35 c0 0e 67  // 메모리[708] 명령어

@000002E4
00 20 1f 73  // 메모리[740] 명령어
00 10 1e f3  // 메모리[744] 명령어
35 c0 0e 67  // 메모리[748] 명령어

@0000030C
30 20 00 73  // 메모리[780] 명령어

@00000334
00 20 1f 73  // 메모리[820] 명령어
00 10 1e f3  // 메모리[824] 명령어
35 c0 0e 67  // 메모리[828] 명령어

@0000035C
fe 00 0c e3  // 메모리[860] 명령어
